# Ex 4.3b  *Field* Operations II

- [In Class](#In-Class)  


- [Exercise 4.3b](#Exercise-4.3b)  
  - [Part 1: Shoes](#Part-1:-Shoes)
  - [Part 2: IMDB_250_Scraped.csv](#Part-2:-Screenscraped-IMBDB-Top-250)

In [24]:
import pandas as pd

# In Class 
Start from the pickle you saved at the end of Ex 4.3a In Class: **4.3a_EX_Employees.pkl**

In [25]:
# Read and display the top rows of the pickle
file = './Data/4.3a_EX_Employees.pkl'

df_employees = pd.read_pickle(file)

df_employees.head(2)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,LastName,FirstName,AreaCode,LocalPhoneNumber
0,1699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950",Robinett,David,(827,525-0100
1,1700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950",Robinson,Rebecca,(829,525-0101

### Get rid of non-numeric junk in AreaCode field

In [26]:
df_employees['AreaCode'] = df_employees['AreaCode'].str.replace('(', '')
df_employees['AreaCode'].head()

0    827
1    829
2    828
Name: AreaCode, dtype: object

### Get rid of non-numeric junk in CurrentSalary

In [27]:
df_employees['CurrentSalary'] = df_employees['CurrentSalary'].str.replace('$', '')
df_employees['CurrentSalary'] = df_employees['CurrentSalary'].str.replace(',', '')

df_employees['CurrentSalary'].head()

0    80950
1    70950
2     5000
Name: CurrentSalary, dtype: object

### Change Data Types

In [28]:
df_employees.dtypes

BusinessEntityID     int64
EmployeeName        object
EmailAddress        object
PhoneNumber         object
StartDate           object
CurrentSalary       object
LastName            object
FirstName           object
AreaCode            object
LocalPhoneNumber    object
dtype: object

In [29]:
df_employees.head(2)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,LastName,FirstName,AreaCode,LocalPhoneNumber
0,1699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,80950,Robinett,David,827,525-0100
1,1700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,70950,Robinson,Rebecca,829,525-0101

In [30]:
# Change CurrentSalary to float
df_employees['CurrentSalary'] = pd.to_numeric(df_employees['CurrentSalary']).astype(float)

df_employees.dtypes

BusinessEntityID      int64
EmployeeName         object
EmailAddress         object
PhoneNumber          object
StartDate            object
CurrentSalary       float64
LastName             object
FirstName            object
AreaCode             object
LocalPhoneNumber     object
dtype: object

In [31]:
# Change StartDate to date
df_employees['StartDate'] = pd.to_datetime(df_employees['StartDate'])

df_employees.dtypes

BusinessEntityID             int64
EmployeeName                object
EmailAddress                object
PhoneNumber                 object
StartDate           datetime64[ns]
CurrentSalary              float64
LastName                    object
FirstName                   object
AreaCode                    object
LocalPhoneNumber            object
dtype: object

In [32]:
# Save the dataframe as a pickle named: 4.3b_EX_Employees.pkl
df_employees.to_pickle('./Data/4.3b_EX_Employees.pkl')

# Ex 4.3b

# Part 1: Shoes  
### Read Ex 4.3a, Part 1 pickle file as the starting point for further data wrangling operations

In [33]:
# Read the pickle and display top rows
df_Shoes = pd.read_pickle('./Data/4.3a_Ex_Shoes_Split.pkl')

df_Shoes.head(3)

,OrderID,Order Date,Shoe_Type,Size,Colour,Sales,StoreID,StateAbbrev,SubstateID
0,1,2018-05-02,Pumps,7 (EU),Gold,"$25,100",CA-121,CA,121
1,2,2018-05-03,Pumps,4 (EU),Gold,"$35,500",CA-235,CA,235
2,3,2018-06-04,Loafer,6 (EU),Gold,"$50,000",NY-12,NY,12

In [34]:
df_Shoes.columns

Index(['OrderID', 'Order Date', 'Shoe_Type', 'Size', 'Colour', 'Sales',
       'StoreID', 'StateAbbrev', 'SubstateID'],
      dtype='object')

### Get rid of non-numeric junk in Sales field

In [35]:
df_Shoes['Sales'] = df_Shoes['Sales'].str.replace('$', '')
df_Shoes['Sales'] = df_Shoes['Sales'].str.replace(',', '')


df_Shoes['Sales'].head()

0    25100
1    35500
2    50000
Name: Sales, dtype: object

### Get rid of non-numeric junk in Size field

In [36]:
df_Shoes['Size'] = df_Shoes['Size'].str.replace('(', '')
df_Shoes['Size'] = df_Shoes['Size'].str.replace('EU', '')
df_Shoes['Size'] = df_Shoes['Size'].str.replace(')', '')


df_Shoes['Size'].head()

0    7
1    4
2    6
Name: Size, dtype: object

### Change Data Types

In [37]:
df_Shoes.dtypes

OrderID         int64
Order Date     object
Shoe_Type      object
Size           object
Colour         object
Sales          object
StoreID        object
StateAbbrev    object
SubstateID     object
dtype: object

In [38]:
# Change the data type of Size from string to int
df_Shoes['Size'] = pd.to_numeric(df_Shoes['Size']).astype(int)

df_Shoes.dtypes

OrderID         int64
Order Date     object
Shoe_Type      object
Size            int32
Colour         object
Sales          object
StoreID        object
StateAbbrev    object
SubstateID     object
dtype: object

In [39]:
# Change the data type of Sales to float
df_Shoes['Size'] = pd.to_numeric(df_Shoes['Size']).astype(float)

df_Shoes.dtypes

OrderID          int64
Order Date      object
Shoe_Type       object
Size           float64
Colour          object
Sales           object
StoreID         object
StateAbbrev     object
SubstateID      object
dtype: object

In [40]:
# Display the top rows of the dataframe
df_Shoes.head(2)

,OrderID,Order Date,Shoe_Type,Size,Colour,Sales,StoreID,StateAbbrev,SubstateID
0,1,2018-05-02,Pumps,7.0,Gold,25100,CA-121,CA,121
1,2,2018-05-03,Pumps,4.0,Gold,35500,CA-235,CA,235

# Part 2: Screenscraped IMDB Top 250  
### Read Ex 4.3a, Part 2 pickle file as the starting point for further data wrangling operations
Start with the pickle file you created at the end of Ex 4.3a, Part 2

In [45]:
#Read the pickle file and display the top rows
df_IMDB = pd.read_pickle('./Data/4.3a_Ex_Part_2.3.pkl')

df_IMDB.head(2)

  Rank                       Title YearWithJunk  IMDb Rating
0    1   The Shawshank Redemption         1994)          9.2
1    2              The Godfather         1972)          9.2

### YearWithJunk: Get rid of Non-Numeric Junk and Rename if *Year*

In [46]:
df_IMDB.columns

Index(['Rank', 'Title', 'YearWithJunk', 'IMDb Rating'], dtype='object')

In [49]:
# Get rid of non-numeric junk in the YearWithJunk field
df_IMDB['YearWithJunk'] = df_IMDB['YearWithJunk'].str.replace(')', '')

df_IMDB['YearWithJunk'].head()

0    1994
1    1972
2    1974
3    2008
4    1957
Name: YearWithJunk, dtype: object

In [50]:
# Rename YearWithJunk to Year
df_IMDB.rename(columns = {'YearWithJunk': 'Year'}, inplace=True) 

df_IMDB.head()

  Rank                       Title  Year  IMDb Rating
0    1   The Shawshank Redemption   1994          9.2
1    2              The Godfather   1972          9.2
2    3     The Godfather: Part II   1974          9.0
3    4            The Dark Knight   2008          9.0
4    5               12 Angry Men   1957          8.9

In [51]:
# Rename IMDb Rating column to Rating
df_IMDB.rename(columns = {'IMDb Rating': 'Rating'}, inplace=True)

df_IMDB.head(2)

  Rank                       Title  Year  Rating
0    1   The Shawshank Redemption   1994     9.2
1    2              The Godfather   1972     9.2

In [52]:
df_IMDB.columns

Index(['Rank', 'Title', 'Year', 'Rating'], dtype='object')

### Reorder columns to:  Rank, Title, Rating, Year

In [53]:
new_cols = ['Rank', 'Title', 'Rating', 'Year']
new_cols

['Rank', 'Title', 'Rating', 'Year']

In [55]:
df_IMDB = df_IMDB[new_cols]
df_IMDB.head(2)

  Rank                       Title  Rating  Year
0    1   The Shawshank Redemption      9.2  1994
1    2              The Godfather      9.2  1972

### Fix data types as needed to get:
- Rank:  int  
- Title: string/object  
- Rating:  float    
- Year: int

In [56]:
df_IMDB.dtypes

Rank       object
Title      object
Rating    float64
Year       object
dtype: object

In [59]:
# Check and fix data types as needed
df_IMDB['Year'] = pd.to_datetime(df_IMDB['Year'])

df_IMDB.dtypes

Rank              object
Title             object
Rating           float64
Year      datetime64[ns]
dtype: object

In [60]:
# Display the top ten movies (by Rank)
df_IMDB.head(10)

  Rank                                            Title  Rating       Year
0    1                        The Shawshank Redemption      9.2 1994-01-01
1    2                                   The Godfather      9.2 1972-01-01
2    3                          The Godfather: Part II      9.0 1974-01-01
3    4                                 The Dark Knight      9.0 2008-01-01
4    5                                    12 Angry Men      8.9 1957-01-01
5    6                                Schindler's List      8.9 1993-01-01
6    7   The Lord of the Rings: The Return of the King      8.9 2003-01-01
7    8                                    Pulp Fiction      8.9 1994-01-01
8    9                          Avengers: Infinity War      8.8 2018-01-01
9   10                  The Good, the Bad and the Ugly      8.8 1966-01-01

In [61]:
# Display the bottom ten (of the 250) movies (by Rank)
df_IMDB.tail(10)

    Rank                                              Title  Rating       Year
240  241                                      Paris, Texas      8.0 1984-01-01
241  242                                  Infernal Affairs      8.0 2002-01-01
242  243                                    Twelve Monkeys      8.0 1995-01-01
243  244                       The Best Years of Our Lives      8.0 1946-01-01
244  245                                Gangs of Wasseypur      8.0 2012-01-01
245  246                                     Before Sunset      8.0 2004-01-01
246  247                              Beauty and the Beast      8.0 1991-01-01
247  248                                 Dog Day Afternoon      8.0 1975-01-01
248  249   Pirates of the Caribbean: The Curse of the Bl...     8.0 2003-01-01
249  250                                        Tangerines      8.0 2013-01-01

### Sort Dataframe

In [65]:
# Sort by Title - Ascending (inplace)
df_IMDB.sort_values('Title', inplace=True, ascending=True)
df_IMDB.head(10)

    Rank                    Title  Rating       Year
4      5            12 Angry Men      8.9 1957-01-01
200  201        12 Years a Slave      8.1 2013-01-01
90    91   2001: A Space Odyssey      8.3 1968-01-01
92    93                3 Idiots      8.3 2009-01-01
237  238                      8½      8.0 1963-01-01
143  144        A Beautiful Mind      8.2 2001-01-01
84    85      A Clockwork Orange      8.3 1971-01-01
109  110            A Separation      8.2 2011-01-01
219  220             A Wednesday      8.0 2008-01-01
51    52                   Alien      8.4 1979-01-01